#แลกเงินและหาจำนวนแบงค์

num = int(input("ป้อนจำนวนเงิน :"))

if num>=1000:
    print("1000 บาท = ",num//1000, "ใบ") #// หารไม่เอาทศนิยม
    num %= 1000 # %= หรือ num=num%1000 (หารเอาเศษ) 

if num >=500:
    print("500 บาท = ",num//500,"ใบ")
    num %= 500 
    
if num >=100:
    print("100 บาท = ",num//100,"ใบ")
    num %= 100
    
if num >=50:
    print("50 บาท = ",num//50,"ใบ")
    num %= 50
    
if num >=20:
    print("20 บาท = ",num//20,"ใบ")    
    num %= 20
    
if num>=10:
    print("10 บาท = ",num//10,"เหรียญ")
    num %= 10
    
if num>=5:
    print("5 บาท = ",num//5,"เหรียญ")
    num %= 5

if num>=1:
    print("1 บาท = ",num//1,"เหรียญ")
    num %= 1
    
    
