// นำเข้าตัวแปรให้เป็นประเภทใน ES6
const player = new Plyr('#player');

// ตั้งค่าตัวเล่นวิดีโอ
player.source = {
  type: 'video',
  sources: [
    {
      src: 'http://127.0.0.1:5500/index.html',
      type: 'application/x-mpegURL' // หรือปรับเป็น 'application/dash+xml' หากมีให้ใส่
    }
  ]
};

// ปรับตัวเล่นวิดีโอเมื่อโหลดสำเร็จแล้ว
player.on('ready', () => {
  console.log('ตัวเล่นวิดีโอพร้อมใช้งานแล้ว');
  // คำสั่งอื่นๆ ที่คุณต้องการให้ทำหลังจากโหลดเสร็จ
});

// เมื่อเล่นวิดีโอ
player.on('play', () => {
  console.log('กำลังเล่นวิดีโอ');
  // คำสั่งอื่นๆ ที่คุณต้องการให้ทำเมื่อเล่นวิดีโอ
});

// เมื่อหยุดวิดีโอ
player.on('pause', () => {
  console.log('หยุดเล่นวิดีโอ');
  // คำสั่งอื่นๆ ที่คุณต้องการให้ทำเมื่อหยุดวิดีโอ
});

// เมื่อกดปุ่มตั้งค่าเสียง
player.on('volumechange', () => {
  console.log('เปลี่ยนระดับเสียง');
  // คำสั่งอื่นๆ ที่คุณต้องการให้ทำเมื่อเปลี่ยนระดับเสียง
});

// เมื่อเกิดข้อผิดพลาดในการโหลด
player.on('error', event => {
  console.warn('เกิดข้อผิดพลาดในการโหลด:', event);
  // คำสั่งอื่นๆ ที่คุณต้องการให้ทำเมื่อเกิดข้อผิดพลาดในการโหลด
});
